In [8]:
import numpy as np 
import pandas as pd

import matplotlib as mpl 
import matplotlib.pyplot as plt

import mysql.connector as mariadb
from dotenv import load_dotenv              # environment variables
import os

In [9]:
# load the environment variables
load_dotenv()

# assign environment variables
PASSWORD = os.getenv('MariaDB_Password')

Functions
- retrieve data from Customer Table
- retrieve data from Branch Table

In [10]:
def get_customer_data():
    try:
        # establish connection to MariaDB
        con = mariadb.connect(
            host='localhost',
            user='root',
            password=PASSWORD,
            database='creditcard_capstone'
        )
        print('Connected to MariaDB database...')

        # create a cursor
        cur = con.cursor()
        # SQL statement
        query = ''' 
        SELECT *
        FROM cdw_sapp_customer
        '''
        # execute SQL statement
        cur.execute(query)

        # convert results to pandas dataframe
        customer_df = pd.DataFrame(cur, columns=['SSN', 
                                                 'FIRST_NAME', 
                                                 'MIDDLE_NAME', 
                                                 'LAST_NAME', 
                                                 'CREDIT_CARD_NO', 
                                                 'FULL_STREET_ADDRESS', 
                                                 'CUST_CITY', 
                                                 'CUST_STATE', 
                                                 'CUST_COUNTRY', 
                                                 'CUST_ZIP', 
                                                 'CUST_PHONE', 
                                                 'CUST_EMAIL', 
                                                 'LAST_UPDATED'])
        # close connection to MariaDB
        con.close()

        return customer_df
    except mariadb.ERROR as err:
        print(err)

In [13]:
def get_branch_data():
    try:
        # establish connection to MariaDB
        con = mariadb.connect(
            host='localhost',
            user='root',
            password=PASSWORD,
            database='creditcard_capstone'
        )
        print('Connected to MariaDB database...')

        # create a cursor
        cur = con.cursor()
        # SQL statement
        query = ''' 
        SELECT *
        FROM cdw_sapp_branch
        '''
        # execute SQL statement
        cur.execute(query)

        # convert results to pandas dataframe
        branch_df = pd.DataFrame(cur, columns=['BRANCH_CODE', 
                                               'BRANCH_NAME', 
                                               'BRANCH_STREET', 
                                               'BRANCH_CITY',
                                               'BRANCH_STATE', 
                                               'BRANCH_ZIP', 
                                               'BRANCH_PHONE', 
                                               'LAST_UPDATED'])
        # close connection to MariaDB
        con.close()

        return branch_df
    except mariadb.ERROR as err:
        print(err)

In [12]:
customer_df = get_customer_data()
customer_df.head()

Connected to MariaDB database...

,SSN,FIRST_NAME,MIDDLE_NAME,LAST_NAME,CREDIT_CARD_NO,FULL_STREET_ADDRESS,CUST_CITY,CUST_STATE,CUST_COUNTRY,CUST_ZIP,CUST_PHONE,CUST_EMAIL,LAST_UPDATED
0,123456100,Alec,wm,Hooper,4210653310061055,"Main Street North, 656",Natchez,MS,United States,39120,(781)123-3781,AHooper@example.com,2018-04-21 12:49:02
1,123453023,Etta,brendan,Holman,4210653310102868,"Redwood Drive, 829",Wethersfield,CT,United States,6109,(781)123-3893,EHolman@example.com,2018-04-21 12:49:02
2,123454487,Wilber,ezequiel,Dunham,4210653310116272,"12th Street East, 683",Huntley,IL,United States,60142,(781)124-4301,WDunham@example.com,2018-04-21 12:49:02
3,123459758,Eugenio,trina,Hardy,4210653310195948,"Country Club Road, 253",NewBerlin,WI,United States,53151,(781)124-4321,EHardy@example.com,2018-04-21 12:49:02
4,123454431,Wilfred,may,Ayers,4210653310356919,"Madison Street, 301",ElPaso,TX,United States,79930,(781)124-4207,WAyers@example.com,2018-04-21 12:49:02

In [15]:
branch_df = get_branch_data()
branch_df.head()

Connected to MariaDB database...

,BRANCH_CODE,BRANCH_NAME,BRANCH_STREET,BRANCH_CITY,BRANCH_STATE,BRANCH_ZIP,BRANCH_PHONE,LAST_UPDATED
0,1,Example Bank,Bridle Court,Lakeville,MN,55044,(781)123-3456,2018-04-18 16:51:47
1,2,Example Bank,Washington Street,Huntley,IL,60142,(781)123-3461,2018-04-18 16:51:47
2,3,Example Bank,Warren Street,SouthRichmondHill,NY,11419,(781)123-3498,2018-04-18 16:51:47
3,4,Example Bank,Cleveland Street,Middleburg,FL,32068,(781)123-3466,2018-04-18 16:51:47
4,5,Example Bank,14th Street,KingOfPrussia,PA,19406,(781)123-3484,2018-04-18 16:51:47